# ჩამოწერეთ 5-5 მაგალითი შემდეგ ოპერატორებზე:  + , - , * , / , ** , %-->


 #(+):

#3 + 5 = 8
#10 + 20 = 30
#7.5 + 2.5 = 10.0
#-4 + 7 = 3
#0 + 100 = 100
# (-):
#10 - 3 = 7
#25 - 7 = 18
#6.5 - 2.0 = 4.5
#-3 - 7 = -10
#50 - 50 = 0
#(*):
#4 * 5 = 20
#2 * 3 = 6
#1.5 * 2 = 3.0
#6 * -2 = -12
#0 * 9 = 0
#(/):
#10 / 2 = 5.0
#7 / 3 = 2.333...
#15 / 5 = 3.0
#-8 / 2 = -4.0
#9 / 3 = 3.0
 #(**):
#2 ** 3 = 8
#5 ** 2 = 25
#10 ** 0 = 1
#3 ** 4 = 81
#7 ** 1 = 7
 #(%):
#10 % 3 = 1
#25 % 7 = 4
#18 % 5 = 3
#100 % 6 = 4
#9 % 2 = 1
# (+):
#5 + 3 = 8
#10 + 7 = 17
#-4 + 6 = 2
#3.5 + 2.5 = 6.0
#0 + 0 = 0
# (-):
#8 - 3 = 5
#10 - 6 = 4
#-5 - 5 = -10
#7.5 - 3.5 = 4.0
#0 - 2 = -2
# (*):
#4 * 2 = 8
#7 * 3 = 21
#5.5 * 2 = 11.0
#-3 * 4 = -12
#0 * 7 = 0
 #(/):
#10 / 2 = 5.0
#9 / 3 = 3.0
#7 / 2 = 3.5
#-8 / 4 = -2.0
#6 / 2 =3 
 #(**):
#2 ** 3 = 8
#3 ** 2 = 9
#10 ** 0 = 1
#4 ** 4 = 256
#5 ** 1 = 5
# (%):
#10 % 3 = 1
#15 % 4 = 3
#9 % 5 = 4
#20 % 6 = 2
#13 % 2 = 1
# (+):
#5 + 3 = 8
#10 + 7 = 17
#4 + 6 = 2
#3.5 + 2.5 = 6.0
#0 + 0 = 0
# (-):
#8 - 3 = 5
#10 - 6 = 4
#-5 - 5 = -10
#7.5 - 3.5 = 4.0
#0 - 2 = -2
# (*):
#4 * 2 = 8
#7 * 3 = 21
#5.5 * 2 = 11.0
#-3 * 4 = -12
#0 * 7 = 0
# (/):
#10 / 2 = 5.0
#9 / 3 = 3.0
#7 / 2 = 3.5
#-8 / 4 = -2.0
#5 / 2 = 2.5
# (**):
#2 ** 3 = 8
#3 ** 2 = 9
#10 ** 0 = 1
#4 ** 4 = 256
#5 ** 1 = 5
# (%):
#10 % 3 = 1
#15 % 4 = 3
#9 % 5 = 4
#20 % 6 = 2
#13 % 2 = 1
 #(+):
#5 + 3 = 8
#10 + 7 = 17
#-4 + 6 = 2
#3.5 + 2.5 = 6.0
#0 + 0 = 0
# (-):
#8 - 3 = 5
#10 - 6 = 4
#-5 - 5 = -10
#7.5 - 3.5 = 4.0
#0 - 2 = -2
# (*):
#4 * 2 = 8
#7 * 3 = 21
#5.5 * 2 = 11.0
#-3 * 4 = -12
#0 * 7 = 0
# (/):
#10 / 2 = 5.0
#9 / 3 = 3.0
#7 / 2 = 3.5
#-8 / 4 = -2.0
#5 / 2 = 2.5
# (**):
#2 ** 3 = 8
#3 ** 2 = 9
#10 ** 0 = 1
#4 ** 4 = 256
#5 ** 1 = 5
# (%):
#10 % 3 = 1
#15 % 4 = 3
#9 % 5 = 4
#20 % 6 = 2
#13 % 2 = 1
# (+):
#3 + 4 = 7
#10 + 5 = 15
#-2 + 8 = 6
#7.5 + 2.5 = 10.0
#0 + 100 = 100
# (-):
#9 - 5 = 4
#20 - 7 = 13
#-5 - 3 = -8
#15.5 - 5.5 = 10.0
#8 - 8 = 0
# (*):
#4 * 6 = 24
#33 * 7 = 21
#-2 * 5 = -10
#5.5 * 2 = 11.0
#0 * 10 = 0
# (/):
#12 / 4 = 3.0
#20 / 5 = 4.0
#7 / 3 = 2.333...
#-8 / 2 = -4.0
#10 / 5 = 2 
# (**):
#2 ** 3 = 8
#4 ** 2 = 16
#5 ** 3 = 125
#10 ** 0 = 1
#7 ** 2 = 49
# (%):
#10 % 3 = 1
#17 % 4 = 1
#20 % 6 = 2
#9 % 5 = 4
#15 % 4 = 3


#3) თქვენი სიტყვებით ახსენით რა დროს გვჭირდება მონაცემთა ტიპის კონვერტაცია

#მონაცემთა ტიპის კონვერტაცია საჭიროა, როცა სხვადასხვა ტიპის მონაცემებს შორის ოპერაციებს 
#ვახორციელებთ, ან როცა უნდა გადაგვაქციოს მონაცემი იმ ფორმატში, რომელიც საჭიროებს
# კონკრეტული პროცესი ან მოქმედება.-->

#4) სამ ადამიანს შემოატანინეთ ასაკები და გამოითვალეთ ამ ასაკების საშუალო არითმეტიკული
#  (ასაკების ჯამი / ადამიანების რაოდენობა)

age1 = int(input("48: "))
age2 = int(input("33: "))
age3 = int(input("40: "))

#   ასაკების ჯამი
total_age = age1 + age2 + age3

#   საშუალო არითმეტიკული
average_age = total_age / 3

#  შედეგი
print("სამი ადამიანის ასაკების საშუალო არითმეტიკული არის", average_age)

#5) მომხმარებელს შემოატანინეთ ასაკი და დაუბეჭდეთ 20 წელში რამდენი წლის იქნება

#   ასაკი
age = int(input("15 "))

#   20 წლის შემდეგ
future_age = age + 20

#  შედეგი
print("20 წელში თქვენ იქნებით", future_age, "წლის.")


#6) შემდეგ 6 შედარების ოპერატორზე: >, <, >=, <=, !=, == ჩამოწერეთ 5-5 მაგალითი,
#  გამოიყენეთ ცვლადები


a = 5
b = 3
print(a > b)  # True, რადგან 5 დიდია 3-ზე

x = 10
y = 15
print(x > y)  # False, რადგან 10 პატარაა 15-ზე

x = 25
y = 18
print(x > y)  # True, რადგან 25 დიდი არის 18-ზე

a = 100
b = 50
print(a > b)  # True, რადგან 100 დიდი არის 50-ზე

a = 150
b = 100
print(a > b)  # True, რადგან 150მეტია 100-ზე


a = 3
b = 5
print(a < b)  # True, რადგან 3 პატარაა 5-ზე

x = 15
y = 10
print(x < y)  # False, რადგან 15 დიდი არის 10-ზე

x = 16
y = 18
print(x < y ) # True, რადგან 16 ნაკლებია 18-ზე

a = 50
b = 100
print(a < b)  # True, რადგან 50 ნაკლებია 100-ზე

cx = 15
y= 18
print(x < y)  # True, რადგან 18 მეტია 15-ზე

a = 10
b = 5
print(a >= b)  # True, რადგან 10 მეტი ან ტოლია 5-ს

x = 8
y = 8
print(x >= y)  # True, რადგან 8 ტოლია 8-ზე

x = 18
y = 18
print(x >= y)  # True, რადგან 18 ტოლია 18-ს

a = 100
b = 150
print(a >= b)  # False, რადგან 100 ნაკლებია 150-ზე

a = 100
b = 150
print(a >= b)  # False, რადგან 150 მეტია 100=ზე


a = 5
b = 10
print(a <= b)  # True, რადგან 5 ნაკლებია ან ტოლია 10-ს

x = 8
y = 8
print(x <= y)  # True, რადგან 8 ტოლია 8-ზე

x = 16
y = 18
print(x <= y)  # True, რადგან 16 ნაკლებია 18-ზე

a = 100
b = 50
print(a <= b)  # False, რადგან 100 დიდი არის 50-ზე

a = 50
b = 100
print(a <= b)  # True, რადგან 50 ნაკლებია <= 100-ზე

a = 5
b = 3
print(a != b)  # True, რადგან 5 არ არის ტოლი 3-ს

x = 10
y = 10
print(x != y)  # False, რადგან 10 არის ტოლი 10-ს

x = 25
y = 18
print(x != y)  # True, რადგან 25 არ არის ტოლი 18-ს

a = 100
b = 50
print(a != b)  # True, რადგან 100 არ არის ტოლი 50-ს

a = 100
b = 50
print(a != b)  # True, რადგან 100 მეტია 50-ზე

a = 5
b = 5
print(a == b)  # True, რადგან 5 არის ტოლი 5-ს

x = 10
y = 20
print(x == y)  # False, რადგან 10 არ არის ტოლი 20-ს

x = 18
y = 18
print(x == y)  # True, რადგან 18 არის ტოლი 18-ს

a = 100
b = 100
print(a == b)  # True, რადგან 100 არის ტოლი 100-ს

a = 100
b = 100
print(a == b)  # True, რადგან 100 ტოლია 100-ზე