# 1) გააკეთეთ 5 მაგალითი თითო შედარების ოპერატორზე (>, <, >=, <=, ==, !=.)

a = 5
b = 3
print(a > b)  # True, რადგან 5 დიდია 3-ზე

x = 10
y = 15
print(x > y)  # False, რადგან 10 პატარაა 15-ზე

x = 25
y = 18
print(x > y)  # True, რადგან 25 დიდი არის 18-ზე

a = 100
b = 50
print(a > b)  # True, რადგან 100 დიდი არის 50-ზე

a = 150
b = 100
print(a > b)  # True, რადგან 150მეტია 100-ზე


a = 3
b = 5
print(a < b)  # True, რადგან 3 პატარაა 5-ზე

x = 15
y = 10
print(x < y)  # False, რადგან 15 დიდი არის 10-ზე

x = 16
y = 18
print(x < y ) # True, რადგან 16 ნაკლებია 18-ზე

a = 50
b = 100
print(a < b)  # True, რადგან 50 ნაკლებია 100-ზე

cx = 15
y= 18
print(x < y)  # True, რადგან 18 მეტია 15-ზე

a = 10
b = 5
print(a >= b)  # True, რადგან 10 მეტი ან ტოლია 5-ს

x = 8
y = 8
print(x >= y)  # True, რადგან 8 ტოლია 8-ზე

x = 18
y = 18
print(x >= y)  # True, რადგან 18 ტოლია 18-ს

a = 100
b = 150
print(a >= b)  # False, რადგან 100 ნაკლებია 150-ზე

a = 100
b = 150
print(a >= b)  # False, რადგან 150 მეტია 100=ზე


a = 5
b = 10
print(a <= b)  # True, რადგან 5 ნაკლებია ან ტოლია 10-ს

x = 8
y = 8
print(x <= y)  # True, რადგან 8 ტოლია 8-ზე

x = 16
y = 18
print(x <= y)  # True, რადგან 16 ნაკლებია 18-ზე

a = 100
b = 50
print(a <= b)  # False, რადგან 100 დიდი არის 50-ზე

a = 50
b = 100
print(a <= b)  # True, რადგან 50 ნაკლებია <= 100-ზე

a = 5
b = 3
print(a != b)  # True, რადგან 5 არ არის ტოლი 3-ს

x = 10
y = 10
print(x != y)  # False, რადგან 10 არის ტოლი 10-ს

x = 25
y = 18
print(x != y)  # True, რადგან 25 არ არის ტოლი 18-ს

a = 100
b = 50
print(a != b)  # True, რადგან 100 არ არის ტოლი 50-ს

a = 100
b = 50
print(a != b)  # True, რადგან 100 მეტია 50-ზე

a = 5
b = 5
print(a == b)  # True, რადგან 5 არის ტოლი 5-ს

x = 10
y = 20
print(x == y)  # False, რადგან 10 არ არის ტოლი 20-ს

x = 18
y = 18
print(x == y)  # True, რადგან 18 არის ტოლი 18-ს

a = 100
b = 100
print(a == b)  # True, რადგან 100 არის ტოლი 100-ს

a = 100
b = 100
print(a == b)  # True, რადგან 100 ტოლია 100-ზე