# 2)ამიხსენით დეტალურად რა არის def ფუნქცია და როგორ იწერება მისი სტრუქტურა

#Python-ში def საკვანძო სიტყვაა, რომელიც გამოიყენება ახალი ფუნქციის შექმნისთვის. 
# ფუნქცია არის კოდი, რომელიც შეიძლება აწყ one's თანმიმდევრობით გამოიძახოს, რათა
#  დაასრულოს დავალება ან დააბრუნოს რიცხვები, ტექსტები, სიები და სხვა.

def function_name(parameter1, parameter2, ):
    result = ...  
    return result

#3) ორი ტექსტის შეერთება
#დაწერე ფუნქცია, რომელიც მიიღებს ორ სტრიქონს და დააბრუნებს მათ შეერთებულ ვერსიას.

# მაგ: combine_texts("Hello", "World") → "HelloWorld"

def combine_texts(text1, text2):
    return text1 + text2

print(combine_texts("Hello", "World")) 

#4) ტექსტის გამრავლება
#აწერე ფუნქცია, რომელიც მიიღებს ტექსტს და რიცხვს, შემდეგ დააბრუნებს ტექსტს იმდენჯერ გამრავლებულს, რამდენიც რიცხვია.

# მაგ: repeat_text("Hi", 3) → "HiHiHi"

def repeat_text(text, count):
    return text * count

print(repeat_text("Hi", 3))  

# 5)f-სტრიქონით მისალმება
#დაწერე ფუნქცია, რომელიც მიიღებს სახელს და დააბრუნებს მისალმების ტექსტს f-სტრიქონის გამოყენებით.

#მაგ: greet("ზუკა") → "გამარჯობა, ზუკა!"

def greet(name):
    return f"გამარჯობა, {name}!"

print(greet("რეზი"))  

#6) სიტყვების ჩამონათვალის f-სტრიქონით ფორმატირება
#დაწერე ფუნქცია, რომელიც მიიღებს სამი სიტყვისგან შემდგარ სიას და დააბრუნებს მათ f-სტრიქონის გამოყენებით.

# მაგ: format_words(["ლომი", "ვეფხვი", "დათვი"]) → "ლომი, ვეფხვი და დათვი"
def format_words(words):
   
    if len(words) != 3:
        return 
    
    first, second, third = words  
    return f"{first}, {second} და {third}"

print(format_words(["ლომი", "ვეფხვი", "დათვი"]))

