#2) შემდეგი 4 ოპერატორის გამოყენებით: +, -, *, /    
#  როგორ მოვახდენთ შემოკლებით ცვლადის მნიშვნელობის განახლებას? 
# ჩამოწერეთ პასუხები. თუ არ გაგახსენდებათ, გადახედეთ პირველ საკლასო დავალებას


num1 = 5

num1 += 5
print(num1)
num1 -= 5
print(num1)
num1 /= 5
print(num1)
num1 *= 5
print(num1)




# 3) თქვენი სიტყვებით ახსენით რა არის debugging
#  და რამდენი ნაწილისგან შედგება, ასევე ამ საკითხზე გააკეთეთ ნახაზი paint-ში

# debugging-ი არის ინსტრუმენტი რომელიც გეხმარება ნახო რა შეცდომეი გაქვს კოდში და შემდეგ ის გამოასწორო.
# შედგება 5 ნაწილისაგან: 1) შეცდომის იდენტიფიცირება; 2) შეცდომის მდებარეობის აღმოჩენა; 3) შეცდომის მიზეზის ანალიზი; 
# 4)შეცდომის გასწორება; 5)ტესტირება.
# 






#4) შექმენით ერთი ცვლადი, რომელსაც 5-ჯერ შეუცვლით
#  მნიშვნელობას და საბოლოოდ დაბეჭდავთ მის მნიშვნელობას

num = 5
num = 8
num = 10
num = 345
num = 3143
print(num)