# 1) თქვენი სიტყვებით ახსენით, პითონში მონაცემები რამდენ ნაწილად იყოფა, თითოეული
#  როდის გვხვდება და სად ვიყენებთ. ასევე გააკეთეთ paint-ში ნახაზი ამ ინფორმაციის შესახებ
#  (მე როგორც ვხაზავ, შეგიძლიათ მსგავსად დახაზოთ)

# სამ ნაწილად ესენია სტრინგი ინტეჯერი და ფლოათი.  სტრინგია რასაც ბრჭყალებში ვწერთ ანუ ციფრები
#და ასობგერები,ინტეჯერი მთელი რიცხვები, ფლოათი ათწილადები
 
# 2) მოცემულ ექვს ოპერატორზე: +, -, *, /, %, **   ჩამოწერეთ 3-3 მაგალითი

print(5+5)
print(5+4)
print(6+7)
print(4-4)
print(5-3)
print(6-2)
print(5*5)
print(5*4)
print(6*7)
print(4/4)
print(5/3)
print(6/2)
print(5%5)
print(5%4)
print(6%7)
print(4**4)
print(5**9)
print(6**2)



#  3) თქვენი სიტყვებით ახსენით რა განსხვავებაა /-სა და %-ს (გაყოფასა და ნაშთიან გაყოფას) შორის
#  %-ეს არის ნაშთიანი აგყოფა /-ეს კი არა

# 4) შექმენით ცვლადები, რომლებშიც მიუთითებთ თქვენი ოჯახის წევრების ასაკს, რის შემდეგაც 
# მათ ჯამს გამოიტანთ ტერმინალში(print ფუნქციის დახმარებით)

bebo=70
mama=40
deda=35
dzma1=8
dzma2=7
me=14

print(bebo)
print(mama)
print(deda)
print(dzma1)
print(dzma2)
print(me)