# 1)  მომხმარებელს უნდა შეყვანოს თავისი სახელი და ასაკი, შემდეგ კი გამოსახოს შეტყობინება ფორმატით:
# გამარჯობა, [სახელი]! შენ ხარ [ასაკი] წლის.

name = input("გთხოვთ, შეიყვანეთ თქვენი სახელი: ")
age = input("გთხოვთ, შეიყვანეთ თქვენი ასაკი: ")

print("გამარჯობა, " + name+ "!" + " შენ ხარ " + age + "წლის.")



# 3) შექმენი 4 ცვლადი ოჯახის წევრებზე, გამოიყენეთ input და შემდეგ გამოთვალეთ 10 წელიწადში რამდენი წლის იქნება.
# ოჯახის წევრების ასაკის შეყვანა
name1 = input("გთხოვთ, შეიყვანეთ პირველი ოჯახის წევრის სახელი: ")
age1 = int(input("რამდენი წლისაა " + name1 + "? "))

name2 = input("გთხოვთ, შეიყვანეთ მეორე ოჯახის წევრის სახელი: ")
age2 = int(input("რამდენი წლისაა " + name2 + "? "))

name3 = input("გთხოვთ, შეიყვანეთ მესამე ოჯახის წევრის სახელი: ")
age3 = int(input("რამდენი წლისაა " + name3 + "? "))

name4 = input("გთხოვთ, შეიყვანეთ მეოთხე ოჯახის წევრის სახელი: ")
age4 = int(input("რამდენი წლისაა " + name4 + "? "))

# შედეგების გამოთვლა და ჩვენება
print("\n10 წელიწადში:")
print(name1 + " იქნება " + str(age1 + 10) + " წლის.")
print(name2 + " იქნება " + str(age2 + 10) + " წლის.")
print(name3 + " იქნება " + str(age3 + 10) + " წლის.")
print(name4 + " იქნება " + str(age4 + 10) + " წლის.")




# 4)შექმენი 2 ცვლადი num1 და num2, გამოიყენეთ input და გამოიყენეთ ეს არითმატიკული მოქმედება: +, - , *, / 
# ორი რიცხვის შეყვანა
num1 = float(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = float(input("შეიყვანეთ მეორე რიცხვი: "))

# არითმეტიკული ოპერაციები
summation = num1 + num2
subtraction = num1 - num2
multiplication = num1 * num2
division = num1 / num2 if num2 != 0 else "ნულზე გაყოფა არ არის შესაძლებელი"

# შედეგების ჩვენება
print("\nმოსახლული ოპერაციების შედეგები:")
print("შესაკრებთა ჯამი: " + str(summation))
print("გამოკლების შედეგი: " + str(subtraction))
print("გამრავლების შედეგი: " + str(multiplication))
print("გაყოფის შედეგი: " + str(division))




# 5) შექმენით 5 ცვლადი და მათში შეინახეთ რიცხვები. შემდეგი 6 ოპერატორის გამოყენებით: +, -, *, /, **, %  ჩამოწერეთ მათ შორის მათემატიკური ოპერაციები. ჩამოწერეთ ასეთი 10 მაგალითი.
# მაგალითად: print((num1 + num2) / num3 - num4*num5 + num1**num3 % num2)

# ორი რიცხვის შეყვანა
num1 = float(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = float(input("შეიყვანეთ მეორე რიცხვი: "))

# არითმეტიკული ოპერაციები
summation = num1 + num2
subtraction = num1 - num2
multiplication = num1 * num2
division = num1 / num2 if num2 != 0 else "ნულზე გაყოფა არ არის შესაძლებელი"

# შედეგების ჩვენება
print("\nმოსახლული ოპერაციების შედეგები:")
print("შესაკრებთა ჯამი: " + str(summation))
print("გამოკლების შედეგი: " + str(subtraction))
print("გამრავლების შედეგი: " + str(multiplication))
print("გაყოფის შედეგი: " + str(division))