#1) for loop-ში გამოიტანეთ რიცხვები 150-დან 202-ის ჩათვლით, ყოველი 2-ე
for i in range(150, 203, 2):
    print(i)

#2) for loop-ში გამოიტანეთ რიცხვები 400-დან 200-ის ჩათვლით
for i in range(400, 199, -1):
    print(i)

#3) თქვენი სიტყვებით ახსენით განსხვავება while და for ციკლებს შორის

#while ციკლი გამოიყენება მაშინ, როცა წინასწარ არ ვიცით რამდენჯერ უნდა შესრულდეს ციკლი.
#for ციკლი კი გამოიყენება მაშინ, როცა წინასწარ ვიცით, რამდენჯერ უნდა შესრულდეს ციკლი

#4) დაბეჭდეთ "GOA BEST!!!" 50-ჯერ, ორივე ციკლით შეასრულეთ ეს დავალება(while loop)
i = 1
while i <= 5:
    print(i)
    i += 1

#5) გამოიყენეთ while loop_ი რომ, დაპრინტოთ ლუწი რიცხვები  1-დან 20-მდე
i = 2  
while i <= 20:
    print(i)
    i += 2  
