#შექმენი ნუსხა, რომელიც შეიცავს 10 რიცხვს (მაგალითად: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(numbers)

#დაბეჭდეთ ნუსხის ელემენტები დიაპაზონით: (დიაპაზონი), რომ დაბეჭდოთ ნუსხის ელემენტები 
# 0-დან 5-მდე (დაახლოებით: [1, 2, 3, 4, 5]).
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
subset = numbers[0:5]  
print(subset)

 #დაბეჭდეთ ნუსხის ელემენტები შემდეგ დიაპაზონზე:
#დაბეჭდეთ ელემენტები 3-დან 7-მდე (დაახლოებით: [4, 5, 6, 7]).
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
subset = numbers[3:7]  
print(subset)

 #დაბეჭდეთ ნუსხის ყველა ელემენტი:
#დაბეჭდეთ ნუსხის ყველა ელემენტი, რომელიც გყავთ
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
for number in numbers:
    print(number)


