#დავალება 1: შექმენი 5 ცვლადი: name,surname,age,number1,number2, რომლებშიც გამოიყენებთ input-ს. საბოლოოდ დაპრინტეთ ხუთივე ცვლადი
# ცვლადების შეყვანა
name = input("გთხოვთ, შეიყვანეთ თქვენი სახელი: ")
surname = input("გთხოვთ, შეიყვანეთ თქვენი გვარი: ")
age = input("გთხოვთ, შეიყვანეთ თქვენი ასაკი: ")
number1 = input("შეიყვანეთ პირველი რიცხვი: ")
number2 = input("შეიყვანეთ მეორე რიცხვი: ")

# შედეგის ჩვენება
print("\nთქვენი შეყვანილი მონაცემებია:")
print("სახელი: " + name)
print("გვარი: " + surname)
print("ასაკი: " + age)
print("პირველი რიცხვი: " + number1)
print("მეორე რიცხვი: " + number2)



# დავალება 1: შექმენი 5 ცვლადი: name,surname,age,number1,number2, რომლებშიც გამოიყენებთ input-ს. საბოლოოდ დაპრინტეთ ხუთივე ცვლადი
# ცვლადების შეყვანა
name = input("შეიყვანეთ თქვენი სახელი: ")
surname = input("შეიყვანეთ თქვენი გვარი: ")
age = input("შეიყვანეთ თქვენი ასაკი: ")
number1 = input("შეიყვანეთ პირველი რიცხვი: ")
number2 = input("შეიყვანეთ მეორე რიცხვი: ")

# ხუთივე ცვლადის ბეჭდვა
print("\nთქვენი შეყვანილი მონაცემებია:")
print("სახელი:", name)
print("გვარი:", surname)
print("ასაკი:", age)
print("პირველი რიცხვი:", number1)
print("მეორე რიცხვი:", number2)



# დავალება 2: შექმენი 2 ცვლადი num 1 და num 2 შემდეგ, დაპრინტეთ ამ ორი რიცხვის ჯამი 
# ორი რიცხვის შეყვანა
num1 = float(input("შეიყვანეთ პირველი რიცხვი: "))
num2 = float(input("შეიყვანეთ მეორე რიცხვი: "))

# რიცხვების ჯამის გამოთვლა და შედეგის ბეჭდვა
sum_of_numbers = num1 + num2
print("ორივე რიცხვის ჯამი არის:", sum_of_numbers)