# 1 თქვენი სიტყვებით ახსენით განსხვავება while და for ციკლებს შორის
#while ციკლი გამოიყენება მაშინ, როცა წინასწარ არ ვიცით რამდენჯერ უნდა შესრულდეს ციკლი.
#for ციკლი კი გამოიყენება მაშინ, როცა წინასწარ ვიცით, რამდენჯერ უნდა შესრულდეს ციკლი

#დაბეჭდეთ "GOA BEST!!!" 100-ჯერ, ორივე ციკლით შეასრულეთ ეს დავალება
i = 0
while i < 100:
    print("GOA BEST!!!")
    i += 1

for _ in range(100):
    print("GOA BEST!!!")


 #while ციკლის დავალებები

 #2რიცხვების დათვლა
#დაწერე პროგრამა, რომელიც while ციკლით დაბეჭდავს რიცხვებს 10-დან 1-მდე უკუღმა.
i = 10
while i >= 1:
    print(i)
    i -= 1

#3რიცხვების ჯამი
#დაწერე პროგრამა, რომელიც while ციკლით დაითვლის რიცხვების ჯამს 1-დან 50-მდე.
sum_numbers = 0
i = 1
while i <= 50:
    sum_numbers += i
    i += 1

print("ჯამი:", sum_numbers)

# for ციკლის დავალებები

#მრავალჯერადი დაბეჭდვა
#დაწერე პროგრამა, რომელიც for ციკლით 7-ჯერ დაბეჭდავს ტექსტს: “მე მიყვარს პროგრამირება”.
for _ in range(7):
    print("მე მიყვარს პროგრამირება")
