# 2) კომენტარებით ახსენით რა არის input-ი და რა არის output-ი.
#  მოიყვანეთ მაგალითები და კარგი იქნება პრეზენტაციასაც თუ გააკეთებთ

# Input (შეყვანა): Input არის მონაცემები, რომლებსაც მომხმარებელი აწვდის პროგრამას მუშაობისას. Python-ში ამისთვის ვიყენებთ input() ფუნქციას, რომელიც მომხმარებელს საშუალებას აძლევს შეიყვანოს ინფორმაცია.

# Output (გამოყვანა): Output არის ინფორმაცია, რომელსაც პროგრამა აბრუნებს ან აჩვენებს მომხმარებელს შესრულების შემდეგ. Python-ში ამისთვის ვიყენებთ print() ფუნქციას.




# 3) დაწერეთ პროგრამა, რომელიც მომხარებელს შემოატანინებს მის სახელს
#  და დაბეჭდავს მისთვის მისალმებას(გამოიყენეთ შემოტანილი სახელი)

nam = input('Enter name: ')
print('Hello ' + nam )


# 4) მომხარებელს შემოატანინეთ სახელი, გვარი, ასაკი და დაბეჭდეთ მათი 
# გამოყენებით ნებისმიერი წინადადება

name = input('Enter name: ')
last_name =input('Enter last name: ')
age = input('Enter your age: ')

print('my name is ' + name + ' ' + 'my last name is ' + last_name + ' my age is ' + ' ' + age)