#1) შემოატანინეთ მომხმარებელს ორი input, რომელსაც float() ფუნქციის გამოყენებით 
#გადააქცევთ ათწილადად, საბოლოოდ მოახდინეთ მათემატიკური ოპერაციები ამ ორ რიცხვს შორის

number1 = input('number')
print(float(1))

number2 = input('number')

#2) თქვენი სიტყვებით, კომენტარის სახით ახსენით რა არის concatenation ( კონკატენაცია )

# კონკატენაცია  არის პროცესის სახელი, როდესაც ორი ან მეტი ელემენტი 
# (მაგალითად, სტრიქონი, ნომრები ან სხვა მონაცემები) იკავშირება ან უკავშირდება ერთმანეთს
#  რათა შეიქმნას ერთიანი მენეჯერული ერთეული.

#3) თქვენი სიტყვებით, კომენტარის სახით ახსენით თუ რას აკეთებს int და float ფუნქციები 

#int და float Python-ის ფუნქციები გთავაზობთ ტიპის
#გადაყვანას.ეს ფუნქციები საშუალებასიძლევა, რომ 
#ნებისმიერი მნიშვნელობა გარდაიქმნას შესაბამის მონაცემთა
#ტიპში