#1) 1) თქვენი სიტყვებით ახსენით, პითონში მონაცემები 
# რამდენ ნაწილად იყოფა, თითოეული როდის გვხვდება და
#  სად ვიყენებთ. ასევე გააკეთეთ paint-ში ნახაზი ამ ინფორმაციის შესახებ 
# (მე როგორც ვხაზავ, შეგიძლიათ მსგავსად დახაზოთ)





 
#2) მოცემულ ექვს ოპერატორზე: +, -, *, /, %, **   ჩამოწერეთ 3-3 მაგალითი 

print(5+5)
print(8+9)
print(4+3)
print(3-2)
print(7-4)
print(8-4)
print(5*7)
print(7*7)
print(3*9)
print(20/4)
print(70/7)
print(30/10)
print(17%4)
print(13%5)
print(17%7)
print(7**3)
print(2**5)
print(5**3)


#3) თქვენი სიტყვებით ახსენით რა განსხვავებაა /-სა და %-ს (გაყოფასა და ნაშთიან გაყოფას) შორის
#განსხვავება /სა და მას% შორის ისს რომ გაყოფისას ამას/ გამოვიყენებთ სე მაგ. 20/4=5 შესრულდა უნშთო
# გაყოფა და ამის % სემთხვევაში დაიჭერება ასე მაგ. 13%6=2 ნაშთი=1 შესრულდა უნაშთო გაყოფა


#4) შექმენით ცვლადები, რომლებშიც მიუთითებთ თქვენი ოჯახის წევრების ასაკს, რის შემდეგაც 
# მათ ჯამს გამოიტანთ ტერმინალში(print ფუნქციის დახმარებით)

bebia=70
mama=40
deda=35
pirveli_dzma=9
meore_dzma=7
me=13
print(bebia+mama+deda+pirveli_dzma+meore_dzma+me)